Repository: Joshikz/Doctor-s-Appointment
Catalog: locale/*/LC_MESSAGES/django.po
Languages: kk

source: Specialty
kk: Мамандығы

source: Phone
kk: Телефон

source: Doctor's image
kk: Дәрігердің суреті

source: Birth date
kk: Туған күні

source: Patient
kk: Пациент

source: Doctor
kk: Дәрігер

source: Date
kk: Күні

source: Time
kk: Уақыты

source: Reason
kk: Себебі

source: Scheduled
kk: Жоспарланған

source: Completed
kk: Аяқталған

source: Cancelled
kk: Бас тартылды

source: Status
kk: Күйі

source: Russian
kk: Орысша

source: English
kk: Ағылшынша

source: Kazakh
kk: Қазақша

source: My profile
kk: Менің профилім

source: Logout
kk: Шығу

source: Login
kk: Кіру

source: Register
kk: Тіркелу

source: Welcome
kk: Қош келдіңіз

source: Doctors
kk: Дәрігерлер

source: Patients
kk: Пациенттер

source: Appointments
kk: Жазылулар

source: Add Appointment
kk: Жаңа жазылу қосу

source: Add New Appointment
kk: Жаңа жазылу қосу

source: Save
kk: Сақтау

source: Cancel
kk: Бас тарту

source: Delete appointment for "%(patient)s" with "%(doctor)s" on %(date)s?
kk: "%(patient)s" пациенті үшін "%(doctor)s" дәрігерімен %(date)s күніне жазылуды өшіруді қалайсыз ба?

source: Confirm
kk: Растау

source: Appointment Details
kk: Жазылу туралы мәліметтер

source: Appointment: %(appointment)s
kk: Жазылу: %(appointment)s

source: Back
kk: Артқа

source: Edit
kk: Өзгерту

source: Delete
kk: Өшіру

source: Appointment
kk: Жазылу

source: You have no appointments.
kk: Сізде жазылулар жоқ.

source: Edit Appointment
kk: Жазылуды өзгерту

source: Add Doctor
kk: Дәрігер қосу

source: Add New Doctor
kk: Дәрігер қосу

source: Delete Doctor
kk: Дәрігерді өшіру

source: Doctor Details
kk: Дәрігерлер тізімі

source: Doctor Image
kk: Дәрігердің суреті

source: Doctors List
kk: Дәрігерлер тізімі

source: Add doctor
kk: Дәрігер қосу

source: Edit Doctor
kk: Дәрігер

source: Add Patient
kk: Пациент қосу

source: Add New Patient
kk: Пациент қосу

source: Delete Patient
kk: Пациентті өшіру

source: Patient Details
kk: Пациенттер тізімі

source: Patients List
kk: Пациенттер тізімі

source: Edit Patient
kk: Пациент қосу

source: Messages
kk: Хабарламалар

source: Site Maps
kk: Сайт карталары

source: Static Files
kk: Статикалық файлдар

source: Syndication
kk: Синдикация

source: That page number is not an integer
kk: Бұл бет нөмірі бүтін сан емес

source: That page number is less than 1
kk: Бұл бет нөмірі 1-ден аз

source: That page contains no results
kk: Бұл бетте нәтиже жоқ

source: Enter a valid value.
kk: Дұрыс мән енгізіңіз.

source: Enter a valid domain name.
kk: Дұрыс домен атауын енгізіңіз.

source: Enter a valid URL.
kk: Дұрыс URL енгізіңіз.

source: Enter a valid integer.
kk: Дұрыс бүтін сан енгізіңіз.

source: Enter a valid email address.
kk: Дұрыс электрондық пошта енгізіңіз.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
kk: Тек әріптерден, сандардан, астыңғы сызықтан немесе сызықшадан тұратын дұрыс «slug» енгізіңіз.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
kk: Юникод әріптері, сандар, астыңғы сызық немесе сызықша бар дұрыс «slug» енгізіңіз.

source: Enter a valid %(protocol)s address.
kk: Дұрыс %(protocol)s мекенжайын енгізіңіз.

source: IPv4 or IPv6
kk: IPv4 немесе IPv6

source: Enter only digits separated by commas.
kk: Тек үтірмен бөлінген сандарды енгізіңіз.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
kk: Бұл мән %(limit_value)s болуы керек (қазір %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
kk: Бұл мән %(limit_value)s-ден аз немесе тең болуы керек.

source: Ensure this value is greater than or equal to %(limit_value)s.
kk: Бұл мән %(limit_value)s-ден көп немесе тең болуы керек.

source: Ensure this value is a multiple of step size %(limit_value)s.
kk: Бұл мән %(limit_value)s еселігі болуы керек.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
kk: Бұл мән %(offset)s бастап %(limit_value)s еселігі болуы керек, мысалы: %(offset)s, %(valid_value1)s, %(valid_value2)s және т.б.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
kk: Бұл мән кемінде %(limit_value)d таңбадан тұруы керек (қазір %(show_value)d).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
kk: Бұл мән ең көбі %(limit_value)d таңбадан аспауы керек (қазір %(show_value)d).

source: Enter a number.
kk: Сан енгізіңіз.

source: Ensure that there are no more than %(max)s digit in total.
kk: Жалпы таңбалар саны %(max)s-ден аспауы керек.

source: Ensure that there are no more than %(max)s decimal place.
kk: Ондық таңбалар саны %(max)s-ден аспауы керек.

source: Ensure that there are no more than %(max)s digit before the decimal point.
kk: Үтірге дейінгі таңбалар саны %(max)s-ден аспауы керек.

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
kk: «%(extension)s» кеңейтімі рұқсат етілмеген. Рұқсат етілген кеңейтімдер: %(allowed_extensions)s.

source: Null characters are not allowed.
kk: Бос таңбаларға рұқсат етілмейді.

source: and
kk: және

source: %(model_name)s with this %(field_labels)s already exists.
kk: Бұл %(field_labels)s бар %(model_name)s бұрыннан бар.

source: Constraint “%(name)s” is violated.
kk: «%(name)s» шектеуі бұзылды.

source: Value %(value)r is not a valid choice.
kk: %(value)r мәні дұрыс таңдау емес.

source: This field cannot be null.
kk: Бұл өріс бос болмауы керек.

source: This field cannot be blank.
kk: Бұл өріс бос болмауы керек.

source: %(model_name)s with this %(field_label)s already exists.
kk: Бұл %(field_label)s бар %(model_name)s бұрыннан бар.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
kk: %(field_label)s %(date_field_label)s %(lookup_type)s үшін бірегей болуы керек.

source: Field of type: %(field_type)s
kk: Өріс түрі: %(field_type)s

source: “%(value)s” value must be either True or False.
kk: «%(value)s» мәні True немесе False болуы керек.

source: “%(value)s” value must be either True, False, or None.
kk: «%(value)s» мәні True, False немесе None болуы керек.

source: Boolean (Either True or False)
kk: Бульдік (True немесе False)

source: String (up to %(max_length)s)
kk: Жол (ең көбі %(max_length)s таңба)

source: String (unlimited)
kk: Жол (шектеусіз)

source: Comma-separated integers
kk: Үтірмен бөлінген бүтін сандар

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
kk: «%(value)s» мәні дұрыс емес күн форматы. YYYY-MM-DD форматында болуы керек.

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
kk: «%(value)s» мәні дұрыс форматта (YYYY-MM-DD), бірақ жарамсыз күн.

source: Date (without time)
kk: Күні (уақытысыз)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
kk: «%(value)s» мәні дұрыс емес форматта. YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] форматында болуы керек.

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
kk: «%(value)s» мәні дұрыс форматта (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]), бірақ жарамсыз күн/уақыт.

source: Date (with time)
kk: Күні (уақытымен)

source: “%(value)s” value must be a decimal number.
kk: «%(value)s» мәні ондық сан болуы керек.

source: Decimal number
kk: Ондық сан

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
kk: «%(value)s» мәні дұрыс емес форматта. [DD] [[HH:]MM:]ss[.uuuuuu] форматында болуы керек.

source: Duration
kk: Ұзақтығы

source: Email address
kk: Электрондық пошта

source: File path
kk: Файл жолы

source: “%(value)s” value must be a float.
kk: «%(value)s» мәні қалқымалы сан болуы керек.

source: Floating point number
kk: Қалқымалы сан

source: “%(value)s” value must be an integer.
kk: «%(value)s» мәні бүтін сан болуы керек.

source: Integer
kk: Бүтін сан

source: Big (8 byte) integer
kk: Үлкен (8 байт) бүтін сан

source: Small integer
kk: Кіші бүтін сан

source: IPv4 address
kk: IPv4 мекенжайы

source: IP address
kk: IP мекенжайы

source: “%(value)s” value must be either None, True or False.
kk: «%(value)s» мәні None, True немесе False болуы керек.

source: Boolean (Either True, False or None)
kk: Бульдік (True, False немесе None)

source: Positive big integer
kk: Оң үлкен бүтін сан

source: Positive integer
kk: Оң бүтін сан

source: Positive small integer
kk: Оң кіші бүтін сан

source: Slug (up to %(max_length)s)
kk: Slug (ең көбі %(max_length)s таңба)

source: Text
kk: Мәтін

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
kk: «%(value)s» мәні дұрыс емес форматта. HH:MM[:ss[.uuuuuu]] форматында болуы керек.

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
kk: «%(value)s» мәні дұрыс форматта (HH:MM[:ss[.uuuuuu]]), бірақ жарамсыз уақыт.

source: Raw binary data
kk: Бинарлық деректер

source: “%(value)s” is not a valid UUID.
kk: «%(value)s» дұрыс UUID емес.

source: Universally unique identifier
kk: Әмбебап бірегей идентификатор

source: File
kk: Файл

source: Image
kk: Сурет

source: A JSON object
kk: JSON объектісі

source: Value must be valid JSON.
kk: Мән дұрыс JSON болуы керек.

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
kk: %(field)s %(value)r мәні бар %(model)s дұрыс таңдау емес.

source: Foreign Key (type determined by related field)
kk: Сыртқы кілт (түрі байланысты өріске байланысты)

source: One-to-one relationship
kk: Бір-біріне қатынас

source: %(from)s-%(to)s relationship
kk: %(from)s-%(to)s қатынасы

source: %(from)s-%(to)s relationships
kk: %(from)s-%(to)s қатынастары

source: Many-to-many relationship
kk: Көптен-көпке қатынас

source: This field is required.
kk: Бұл өріс міндетті.

source: Enter a whole number.
kk: Бүтін сан енгізіңіз.

source: Enter a valid date.
kk: Дұрыс күн енгізіңіз.

source: Enter a valid time.
kk: Дұрыс уақыт енгізіңіз.

source: Enter a valid date/time.
kk: Дұрыс күн/уақыт енгізіңіз.

source: Enter a valid duration.
kk: Дұрыс ұзақтық енгізіңіз.

source: The number of days must be between {min_days} and {max_days}.
kk: Күндер саны {min_days} және {max_days} арасында болуы керек.

source: No file was submitted. Check the encoding type on the form.
kk: Файл жіберілмеді. Форманың кодтау түрін тексеріңіз.

source: No file was submitted.
kk: Файл жіберілмеді.

source: The submitted file is empty.
kk: Жіберілген файл бос.

source: Ensure this filename has at most %(max)d character (it has %(length)d).
kk: Файл атауы %(max)d таңбадан аспауы керек (қазір %(length)d).

source: Please either submit a file or check the clear checkbox, not both.
kk: Файл жіберіңіз немесе тазалау құсбелгісін қойыңыз, екеуін бірдей емес.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
kk: Дұрыс сурет жүктеңіз. Жүктелген файл сурет емес немесе бүлінген.

source: Select a valid choice. %(value)s is not one of the available choices.
kk: Дұрыс таңдау таңдаңыз. %(value)s қолжетімді таңдаулардың бірі емес.

source: Enter a list of values.
kk: Мәндер тізімін енгізіңіз.

source: Enter a complete value.
kk: Толық мән енгізіңіз.

source: Enter a valid UUID.
kk: Дұрыс UUID енгізіңіз.

source: Enter a valid JSON.
kk: Дұрыс JSON енгізіңіз.

source: (Hidden field %(name)s) %(error)s
kk: (Жасырын өріс %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
kk: ManagementForm деректері жоқ немесе өзгертілген. Жоқ өрістер: %(field_names)s. Мәселе шешілмесе, қате туралы хабарлаңыз.

source: Please submit at most %(num)d form.
kk: Ең көбі %(num)d форма жіберіңіз.

source: Please submit at least %(num)d form.
kk: Кемінде %(num)d форма жіберіңіз.

source: Order
kk: Рет

source: Please correct the duplicate data for %(field)s.
kk: %(field)s үшін қайталанатын деректерді түзетіңіз.

source: Please correct the duplicate data for %(field)s, which must be unique.
kk: %(field)s үшін қайталанатын деректерді түзетіңіз, ол бірегей болуы керек.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
kk: %(date_field)s ішіндегі %(lookup)s үшін %(field_name)s қайталанатын деректерді түзетіңіз, ол бірегей болуы керек.

source: Please correct the duplicate values below.
kk: Төмендегі қайталанатын мәндерді түзетіңіз.

source: The inline value did not match the parent instance.
kk: Ішкі мән ата-анасымен сәйкес келмейді.

source: Select a valid choice. That choice is not one of the available choices.
kk: Дұрыс таңдау таңдаңыз. Бұл таңдау қолжетімді таңдаулардың бірі емес.

source: “%(pk)s” is not a valid value.
kk: «%(pk)s» дұрыс мән емес.

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
kk: %(datetime)s %(current_timezone)s уақыт белдеуінде түсіндірілмеді; ол екіұшты немесе жоқ болуы мүмкін.

source: Clear
kk: Тазалау

source: Currently
kk: Қазіргі

source: Change
kk: Өзгерту

source: Unknown
kk: Белгісіз

source: Yes
kk: Иә

source: No
kk: Жоқ

source: yes,no,maybe
kk: иә,жоқ,мүмкін

source: %(size)d byte
kk: %(size)d байт

source: %s KB
kk: %s КБ

source: %s MB
kk: %s МБ

source: %s GB
kk: %s ГБ

source: %s TB
kk: %s ТБ

source: %s PB
kk: %s ПБ

source: p.m.
kk: түстен кейін

source: a.m.
kk: таңертең

source: midnight
kk: түн ортасы

source: noon
kk: түскі

source: Monday
kk: Дүйсенбі

source: Tuesday
kk: Сейсенбі

source: Wednesday
kk: Сәрсенбі

source: Thursday
kk: Бейсенбі

source: Friday
kk: Жұма

source: Saturday
kk: Сенбі

source: Sunday
kk: Жексенбі

source: Mon
kk: Дс

source: Tue
kk: Сс

source: Wed
kk: Ср

source: Thu
kk: Бс

source: Fri
kk: Жм

source: Sat
kk: Сб

source: Sun
kk: Жк

source: January
kk: Қаңтар

source: February
kk: Ақпан

source: March
kk: Наурыз

source: April
kk: Сәуір

source: May
kk: Мамыр

source: June
kk: Маусым

source: July
kk: Шілде

source: August
kk: Тамыз

source: September
kk: Қыркүйек

source: October
kk: Қазан

source: November
kk: Қараша

source: December
kk: Желтоқсан

source: jan
kk: қаң

source: feb
kk: ақп

source: mar
kk: нау

source: apr
kk: сәу

source: may
kk: мам

source: jun
kk: мау

source: jul
kk: шіл

source: aug
kk: там

source: sep
kk: қыр

source: oct
kk: қаз

source: nov
kk: қар

source: dec
kk: жел

# abbrev. month
source: Jan.
kk: Қаң.

# abbrev. month
source: Feb.
kk: Ақп.

# abbrev. month
source: March
kk: Наур.

# abbrev. month
source: April
kk: Сәу.

# abbrev. month
source: May
kk: Мам.

# abbrev. month
source: June
kk: Маус.

# abbrev. month
source: July
kk: Шіл.

# abbrev. month
source: Aug.
kk: Там.

# abbrev. month
source: Sept.
kk: Қыр.

# abbrev. month
source: Oct.
kk: Қаз.

# abbrev. month
source: Nov.
kk: Қар.

# abbrev. month
source: Dec.
kk: Жел.

# alt. month
source: January
kk: Қаңтар

# alt. month
source: February
kk: Ақпан

# alt. month
source: March
kk: Наурыз

# alt. month
source: April
kk: Сәуір

# alt. month
source: May
kk: Мамыр

# alt. month
source: June
kk: Маусым

# alt. month
source: July
kk: Шілде

# alt. month
source: August
kk: Тамыз

# alt. month
source: September
kk: Қыркүйек

# alt. month
source: October
kk: Қазан

# alt. month
source: November
kk: Қараша

# alt. month
source: December
kk: Желтоқсан

source: This is not a valid IPv6 address.
kk: Бұл дұрыс IPv6 мекенжайы емес.

source: or
kk: немесе

source: %(num)d year
kk: %(num)d жыл

source: %(num)d month
kk: %(num)d ай

source: %(num)d week
kk: %(num)d апта

source: %(num)d day
kk: %(num)d күн

source: %(num)d hour
kk: %(num)d сағат

source: %(num)d minute
kk: %(num)d минут

source: Forbidden
kk: Тыйым салынған

source: CSRF verification failed. Request aborted.
kk: CSRF тексеруі сәтсіз аяқталды. Сұраныс тоқтатылды.

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
kk: Бұл хабарламаны көріп отырсыз, себебі бұл HTTPS сайтқа браузеріңізден «Referer header» жіберілуі керек, бірақ ол жіберілмеді. Бұл қауіпсіздік үшін қажет, браузеріңізді үшінші тараптар басып алмауы үшін.

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
kk: Егер браузеріңізде «Referer» тақырыптарын өшірсеңіз, оларды қайта қосыңыз, кем дегенде осы сайт үшін немесе HTTPS қосылымдары үшін, немесе «same-origin» сұраныстары үшін.

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
kk: Егер <meta name="referrer" content="no-referrer"> тегін немесе «Referrer-Policy: no-referrer» тақырыбын қолдансаңыз, оларды алып тастаңыз. CSRF қорғанысы қатаң referer тексеру үшін «Referer» тақырыбын талап етеді. Құпиялылыққа алаңдасаңыз, үшінші тарап сайттарына сілтемелер үшін <a rel="noreferrer" …> сияқты баламаларды қолданыңыз.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
kk: Бұл хабарламаны көріп отырсыз, себебі бұл сайтқа форма жібергенде CSRF cookie қажет. Бұл cookie қауіпсіздік үшін қажет, браузеріңізді үшінші тараптар басып алмауы үшін.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
kk: Егер браузеріңізде cookie-лерді өшірсеңіз, оларды қайта қосыңыз, кем дегенде осы сайт үшін немесе «same-origin» сұраныстары үшін.

source: More information is available with DEBUG=True.
kk: Толығырақ ақпаратты DEBUG=True арқылы көруге болады.

source: No year specified
kk: Жыл көрсетілмеген

source: Date out of range
kk: Күн диапазоннан тыс

source: No month specified
kk: Ай көрсетілмеген

source: No day specified
kk: Күн көрсетілмеген

source: No week specified
kk: Апта көрсетілмеген

source: No %(verbose_name_plural)s available
kk: %(verbose_name_plural)s жоқ

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
kk: Келешектегі %(verbose_name_plural)s қолжетімсіз, себебі %(class_name)s.allow_future False.

source: Invalid date string “%(datestr)s” given format “%(format)s”
kk: «%(datestr)s» күн жолы дұрыс емес, формат «%(format)s»

source: No %(verbose_name)s found matching the query
kk: Сұранысқа сәйкес %(verbose_name)s табылмады

source: Page is not “last”, nor can it be converted to an int.
kk: Бет «last» емес және бүтін санға түрлендірілмейді.

source: Invalid page (%(page_number)s): %(message)s
kk: Дұрыс емес бет (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
kk: Тізім бос және «%(class_name)s.allow_empty» False.

source: Directory indexes are not allowed here.
kk: Мұнда каталог индекстеріне рұқсат етілмейді.

source: “%(path)s” does not exist
kk: «%(path)s» жоқ

source: Index of %(directory)s
kk: %(directory)s индексі

source: The install worked successfully! Congratulations!
kk: Орнату сәтті аяқталды! Құттықтаймыз!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
kk: Django %(version)s үшін <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">шығарылым жазбаларын</a> қараңыз

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
kk: Бұл бетті көріп отырсыз, себебі <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> параметрі қосылған және ешқандай URL бапталмаған.

source: Django Documentation
kk: Django құжаттамасы

source: Topics, references, &amp; how-to’s
kk: Тақырыптар, анықтамалар және нұсқаулықтар

source: Tutorial: A Polling App
kk: Оқу құралы: Сауалнама қолданбасы

source: Get started with Django
kk: Django-мен бастау

source: Django Community
kk: Django қауымдастығы

source: Connect, get help, or contribute
kk: Байланысыңыз, көмек алыңыз немесе үлес қосыңыз
